In [1]:
import pandas as pd
import numpy as np

In [3]:
d = pd.date_range('2023-01-01',periods = 6)
d

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df  =pd.DataFrame(np.random.randn(6,4),index =d,columns=['A','B','C','D'])
df

                   A         B         C         D
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491
2023-01-03  1.312669  0.900258 -1.236679 -0.648650
2023-01-04 -0.136454 -0.763986  0.306001  1.001914
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642

In [7]:
df.head(2)

                   A         B         C         D
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491

In [9]:
df.tail(2)

                   A         B         C         D
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.063060 -0.050499 -0.340115 -0.217596
std    0.945448  1.219384  0.626805  0.866190
min   -1.354775 -1.524300 -1.236679 -1.014153
25%   -0.446815 -1.025396 -0.792147 -0.781394
50%    0.201952  0.067542 -0.153931 -0.611570
75%    0.560214  0.899961  0.113568  0.422963
max    1.312669  1.298498  0.306001  1.001914

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2023-01-01 to 2023-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [13]:
df.index

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.to_numpy

<bound method DataFrame.to_numpy of                    A         B         C         D
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491
2023-01-03  1.312669  0.900258 -1.236679 -0.648650
2023-01-04 -0.136454 -0.763986  0.306001  1.001914
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642>

In [16]:
df.shape

(6, 4)

In [17]:
df.size

24

In [20]:
df

                   A         B         C         D
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491
2023-01-03  1.312669  0.900258 -1.236679 -0.648650
2023-01-04 -0.136454 -0.763986  0.306001  1.001914
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642

In [22]:
df.sort_values(by = ["C"],ascending = True)

                   A         B         C         D
2023-01-03  1.312669  0.900258 -1.236679 -0.648650
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642
2023-01-04 -0.136454 -0.763986  0.306001  1.001914

In [33]:
df.sort_values(by = ["D","C"],ascending = [True,True])

                   A         B         C         D
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642
2023-01-03  1.312669  0.900258 -1.236679 -0.648650
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-04 -0.136454 -0.763986  0.306001  1.001914

In [34]:
df["A"]

2023-01-01   -0.550269
2023-01-02    0.540358
2023-01-03    1.312669
2023-01-04   -0.136454
2023-01-05    0.566833
2023-01-06   -1.354775
Freq: D, Name: A, dtype: float64

In [35]:
#acess the row 
df.loc["2023-01-01",['A','B']]

A   -0.550269
B    0.899069
Name: 2023-01-01 00:00:00, dtype: float64

In [38]:
df.iloc[3]

A   -0.136454
B   -0.763986
C    0.306001
D    1.001914
Name: 2023-01-04 00:00:00, dtype: float64

In [42]:
df.loc['2022-09-01','A']=3

In [40]:
df

                   A         B         C         D
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491
2023-01-03  1.312669  0.900258 -1.236679 -0.648650
2023-01-04 -0.136454 -0.763986  0.306001  1.001914
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642
2022-09-01  3.000000       NaN       NaN       NaN

In [43]:
df.drop('2022-09-01',axis = 0,inplace = True)

In [44]:
df

                   A         B         C         D
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491
2023-01-03  1.312669  0.900258 -1.236679 -0.648650
2023-01-04 -0.136454 -0.763986  0.306001  1.001914
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642

In [45]:
df.loc[(df['A']<0.5) |(df['C']<0.5)]

                   A         B         C         D
2023-01-01 -0.550269  0.899069 -0.267608  0.755447
2023-01-02  0.540358 -1.524300 -0.040254 -0.574491
2023-01-03  1.312669  0.900258 -1.236679 -0.648650
2023-01-04 -0.136454 -0.763986  0.306001  1.001914
2023-01-05  0.566833  1.298498 -0.966994 -1.014153
2023-01-06 -1.354775 -1.112533  0.164842 -0.825642

In [47]:
df.loc[:,["A","B"]]

                   A         B
2023-01-01 -0.550269  0.899069
2023-01-02  0.540358 -1.524300
2023-01-03  1.312669  0.900258
2023-01-04 -0.136454 -0.763986
2023-01-05  0.566833  1.298498
2023-01-06 -1.354775 -1.112533

In [ ]:
df.loc[:,["A","B"]]

In [49]:
df.loc['2023-01-06']

A   -1.354775
B   -1.112533
C    0.164842
D   -0.825642
Name: 2023-01-06 00:00:00, dtype: float64

In [51]:
df.reset_index(drop =True)

          A         B         C         D
0 -0.550269  0.899069 -0.267608  0.755447
1  0.540358 -1.524300 -0.040254 -0.574491
2  1.312669  0.900258 -1.236679 -0.648650
3 -0.136454 -0.763986  0.306001  1.001914
4  0.566833  1.298498 -0.966994 -1.014153
5 -1.354775 -1.112533  0.164842 -0.825642

In [62]:
left =pd.DataFrame({'FRUITS':['AppLe','Kiwi','banana','Coconut'],'PRICE':[100,120,50,60]})
right =pd.DataFrame({'FAST FOOD':['Fried Rice','Egg Rice','soup','vada pav'],'PRICE':[100,70,50,20]})

In [63]:
left

    FRUITS  PRICE
0    AppLe    100
1     Kiwi    120
2   banana     50
3  Coconut     60

In [64]:
right

    FAST FOOD  PRICE
0  Fried Rice    100
1    Egg Rice     70
2        soup     50
3    vada pav     20

In [68]:
df1 = pd.merge(left,right)

In [69]:
df1

   FRUITS  PRICE   FAST FOOD
0   AppLe    100  Fried Rice
1  banana     50        soup

In [70]:
df2  = pd.DataFrame([("bird",np.nan),('bird',34),('Mamal',89),(np.nan,777)],
                   
                     index = ["falcon","Parrot","Monkey","Lion"],
                      columns = ('Class','Speed'))

In [71]:
df2

        Class  Speed
falcon   bird    NaN
Parrot   bird   34.0
Monkey  Mamal   89.0
Lion      NaN  777.0

In [72]:
df2.isnull().sum()

Class    1
Speed    1
dtype: int64

In [73]:

df2.dropna(inplace = True)

In [75]:
df2

        Class  Speed
Parrot   bird   34.0
Monkey  Mamal   89.0

In [92]:
df3 = pd.DataFrame([(np.nan,3,4,np.nan),(4,np.nan,34,np.nan),(np.nan,4,np.nan,89),(np.nan,np.nan,777,67)],
                   
                     index = [np.arange(4)],
                      columns = ('A','B','C','D'))

In [93]:
df3

     A    B      C     D
0  NaN  3.0    4.0   NaN
1  4.0  NaN   34.0   NaN
2  NaN  4.0    NaN  89.0
3  NaN  NaN  777.0  67.0

In [94]:
df3.fillna(0)

     A    B      C     D
0  0.0  3.0    4.0   0.0
1  4.0  0.0   34.0   0.0
2  0.0  4.0    0.0  89.0
3  0.0  0.0  777.0  67.0

In [97]:
d= {'A':11,'B':22,'C':33,'D':44}
df3.fillna(value=d)

      A     B      C     D
0  11.0   3.0    4.0  44.0
1   4.0  22.0   34.0  44.0
2  11.0   4.0   33.0  89.0
3  11.0  22.0  777.0  67.0

In [86]:
df4 = pd.DataFrame([[4,9]]*4,columns=["A","B"])
df4

   A  B
0  4  9
1  4  9
2  4  9
3  4  9

In [98]:
df4.apply(np.sum,axis =1)

0    13
1    13
2    13
3    13
dtype: int64

In [101]:
df5 = pd.DataFrame({'Student1':['OK','Better','Perfect'],'Student2':['OK','Better','Perfect'],'Student3':['OK','Better','Perfect']})
df5

  Student1 Student2 Student3
0       OK       OK       OK
1   Better   Better   Better
2  Perfect  Perfect  Perfect

In [102]:
df5.replace(['OK','Better','Perfect'],[3,2,1])
df5

  Student1 Student2 Student3
0       OK       OK       OK
1   Better   Better   Better
2  Perfect  Perfect  Perfect